articleList/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ghjg"], ["body", "ghjgjhgjh"], ["published", 0], ["created_at", "2023-04-28 19:02:34.076561"], ["updated_at", "2023-04-28 19:02:34.076561"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "published" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["published", 1], ["updated_at", "2023-04-28 18:53:03.286518"], ["id", 1]]